/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
			   Севастопольский государственный университет
					Кафедра «Информационные системы»
	  Программа для организации и обработки записей расхода энергии

												РАЗРАБОТАЛ
												Студент гр. ИТ/б-23-3-о
												Баймурадов Т. Р.
									2024
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Основные функции программы:
1. Начальное создание таблицы;
2. Просмотр таблицы;
3. Добавление новой записи в таблицу;
4. Удаление записи;
5. Корректировка записи в таблице;
6. Поиск в таблице;
7. Сортировка таблицы;
8. Сохранение таблицы в файле;
9. Чтение данных из файла;
10. Расчет отклонения фактического расхода энергии от запланированного;
11. Выход.

	  Вариант задания 1. Утверждено 13.09.2024
	  Среда программирования Visual Studio 2022 Community
	  Дата последней коррекции: 20.12.2024
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

#include "coursework/coursework.h"

int main(int argc, char** argv)
{
    return Main(argc, argv);
}